        IDENTIFICATION DIVISION.
        PROGRAM-ID. HELLO.

        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 WS-CNT1 PIC 9(2) VALUE 0.
        01 WS-CNT2 PIC 9(2) VALUE 0.
        01 WS-STRING PIC X(15) VALUE 'ABCDACDADEAAAFF'.
        
        PROCEDURE DIVISION.
        INSPECT WS-STRING TALLYING WS-CNT1 FOR CHARACTERS.
        DISPLAY "WS-CNT1 : "WS-CNT1.
        INSPECT WS-STRING TALLYING WS-CNT2 FOR ALL 'A'.
        DISPLAY "WS-CNT2 : "WS-CNT2
        
        STOP RUN.
