000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO.
000300 AUTHOR. TUTORIALSPOINT.
000400* THIS IS A COMMENT LINE
000500 PROCEDURE DIVISION.
000600 A000-FIRST-PARA.
000700* First Para Begins - Documentation Purpose
000800     DISPLAY "Comment line".
000900     STOP RUN.
